documents/mongodb/stress_testing/JMeter_usage/templates/step_thread_group.jmx
<?xml version="1.0" encoding="UTF-8"?>
<jmeterTestPlan version="1.2" properties="5.0" jmeter="5.4.1">
  <hashTree>
    <TestPlan guiclass="TestPlanGui" testclass="TestPlan" testname="Test Plan" enabled="true">
      <boolProp name="TestPlan.functional_mode">false</boolProp>
      <boolProp name="TestPlan.tearDown_on_shutdown">true</boolProp>
      <boolProp name="TestPlan.serialize_threadgroups">false</boolProp>
      <elementProp name="TestPlan.user_defined_variables" elementType="Arguments" guiclass="ArgumentsPanel" testclass="Arguments" testname="User Defined Variables" enabled="true">
        <collectionProp name="Arguments.arguments"/>
      </elementProp>
    </TestPlan>
    <hashTree>
      <kg.apc.jmeter.threads.SteppingThreadGroup guiclass="kg.apc.jmeter.threads.SteppingThreadGroupGui" testclass="kg.apc.jmeter.threads.SteppingThreadGroup" testname="search_related_inst_asso" enabled="true">
        <stringProp name="ThreadGroup.on_sample_error">continue</stringProp>
        <stringProp name="ThreadGroup.num_threads">100</stringProp>
        <stringProp name="Threads initial delay">0</stringProp>
        <stringProp name="Start users count">10</stringProp>
        <stringProp name="Start users count burst">0</stringProp>
        <stringProp name="Start users period">30</stringProp>
        <stringProp name="Stop users count">5</stringProp>
        <stringProp name="Stop users period">1</stringProp>
        <stringProp name="flighttime">60</stringProp>
        <stringProp name="rampUp">5</stringProp>
        <elementProp name="ThreadGroup.main_controller" elementType="LoopController" guiclass="LoopControlPanel" testclass="LoopController" testname="Loop Controller" enabled="true">
          <boolProp name="LoopController.continue_forever">false</boolProp>
          <intProp name="LoopController.loops">-1</intProp>
        </elementProp>
      </kg.apc.jmeter.threads.SteppingThreadGroup>
      <hashTree>
        <ConfigTestElement guiclass="HttpDefaultsGui" testclass="ConfigTestElement" testname="HTTP Request Defaults" enabled="true">
          <elementProp name="HTTPsampler.Arguments" elementType="Arguments" guiclass="HTTPArgumentsPanel" testclass="Arguments" testname="User Defined Variables" enabled="true">
            <collectionProp name="Arguments.arguments"/>
          </elementProp>
          <stringProp name="HTTPSampler.domain">paas.bkdevee3.com</stringProp>
          <stringProp name="HTTPSampler.port">80</stringProp>
          <stringProp name="HTTPSampler.protocol">http</stringProp>
          <stringProp name="HTTPSampler.concurrentPool">6</stringProp>
        </ConfigTestElement>
        <hashTree/>
        <HTTPSamplerProxy guiclass="HttpTestSampleGui" testclass="HTTPSamplerProxy" testname="search_related_inst_asso-switchport" enabled="true">
          <boolProp name="HTTPSampler.postBodyRaw">true</boolProp>
          <elementProp name="HTTPsampler.Arguments" elementType="Arguments">
            <collectionProp name="Arguments.arguments">
              <elementProp name="" elementType="HTTPArgument">
                <boolProp name="HTTPArgument.always_encode">false</boolProp>
                <stringProp name="Argument.value">{&#xd;
    &quot;bk_app_code&quot;:&quot;bk_sops&quot;,&#xd;
    &quot;bk_app_secret&quot;:&quot;72f2505a-585c-44e5-858a-dc1e76e0d33a&quot;,&#xd;
    &quot;bk_username&quot;:&quot;admin&quot;,&#xd;
    &quot;bk_supplier_account&quot;:&quot;0&quot;,&#xd;
    &quot;condition&quot;: {&#xd;
        &quot;bk_inst_id&quot;: 38,&#xd;
        &quot;bk_obj_id&quot;: &quot;switch_port&quot;&#xd;
    },&#xd;
    &quot;fields&quot;: [&#xd;
        &quot;id&quot;,&#xd;
        &quot;bk_inst_id&quot;,&#xd;
        &quot;bk_obj_id&quot;,&#xd;
        &quot;bk_asst_inst_id&quot;,&#xd;
        &quot;bk_asst_obj_id&quot;,&#xd;
        &quot;bk_obj_asst_id&quot;,&#xd;
        &quot;bk_asst_id&quot;&#xd;
        ],&#xd;
    &quot;page&quot;: {&#xd;
        &quot;start&quot;:0,&#xd;
        &quot;limit&quot;:1&#xd;
    }&#xd;
}</stringProp>
                <stringProp name="Argument.metadata">=</stringProp>
              </elementProp>
            </collectionProp>
          </elementProp>
          <stringProp name="HTTPSampler.path">api/c/compapi/v2/cc/search_related_inst_asso/</stringProp>
          <stringProp name="HTTPSampler.method">POST</stringProp>
          <boolProp name="HTTPSampler.follow_redirects">true</boolProp>
          <boolProp name="HTTPSampler.auto_redirects">false</boolProp>
          <boolProp name="HTTPSampler.use_keepalive">true</boolProp>
          <boolProp name="HTTPSampler.DO_MULTIPART_POST">false</boolProp>
        </HTTPSamplerProxy>
        <hashTree/>
        <HTTPSamplerProxy guiclass="HttpTestSampleGui" testclass="HTTPSamplerProxy" testname="search_related_inst_asso-lenant" enabled="false">
          <boolProp name="HTTPSampler.postBodyRaw">true</boolProp>
          <elementProp name="HTTPsampler.Arguments" elementType="Arguments">
            <collectionProp name="Arguments.arguments">
              <elementProp name="" elementType="HTTPArgument">
                <boolProp name="HTTPArgument.always_encode">false</boolProp>
                <stringProp name="Argument.value">{&#xd;
    &quot;bk_app_code&quot;:&quot;bk_sops&quot;,&#xd;
    &quot;bk_app_secret&quot;:&quot;72f2505a-585c-44e5-858a-dc1e76e0d33a&quot;,&#xd;
    &quot;bk_username&quot;:&quot;admin&quot;,&#xd;
    &quot;bk_supplier_account&quot;:&quot;0&quot;,&#xd;
    &quot;condition&quot;: {&#xd;
        &quot;bk_inst_id&quot;: 1100038,&#xd;
        &quot;bk_obj_id&quot;: &quot;lenant&quot;&#xd;
    },&#xd;
    &quot;fields&quot;: [&#xd;
        &quot;id&quot;,&#xd;
        &quot;bk_inst_id&quot;,&#xd;
        &quot;bk_obj_id&quot;,&#xd;
        &quot;bk_asst_inst_id&quot;,&#xd;
        &quot;bk_asst_obj_id&quot;,&#xd;
        &quot;bk_obj_asst_id&quot;,&#xd;
        &quot;bk_asst_id&quot;&#xd;
        ],&#xd;
    &quot;page&quot;: {&#xd;
        &quot;start&quot;:20000,&#xd;
        &quot;limit&quot;:1&#xd;
    }&#xd;
}</stringProp>
                <stringProp name="Argument.metadata">=</stringProp>
              </elementProp>
            </collectionProp>
          </elementProp>
          <stringProp name="HTTPSampler.path">api/c/compapi/v2/cc/search_related_inst_asso/</stringProp>
          <stringProp name="HTTPSampler.method">POST</stringProp>
          <boolProp name="HTTPSampler.follow_redirects">true</boolProp>
          <boolProp name="HTTPSampler.auto_redirects">false</boolProp>
          <boolProp name="HTTPSampler.use_keepalive">true</boolProp>
          <boolProp name="HTTPSampler.DO_MULTIPART_POST">false</boolProp>
        </HTTPSamplerProxy>
        <hashTree/>
        <HTTPSamplerProxy guiclass="HttpTestSampleGui" testclass="HTTPSamplerProxy" testname="search_inst_by_object-lenant" enabled="false">
          <boolProp name="HTTPSampler.postBodyRaw">true</boolProp>
          <elementProp name="HTTPsampler.Arguments" elementType="Arguments">
            <collectionProp name="Arguments.arguments">
              <elementProp name="" elementType="HTTPArgument">
                <boolProp name="HTTPArgument.always_encode">false</boolProp>
                <stringProp name="Argument.value">{&#xd;
    &quot;bk_app_code&quot;:&quot;bk_sops&quot;,&#xd;
    &quot;bk_app_secret&quot;:&quot;72f2505a-585c-44e5-858a-dc1e76e0d33a&quot;,&#xd;
    &quot;bk_username&quot;:&quot;admin&quot;,&#xd;
    &quot;bk_obj_id&quot;:&quot;lenant&quot;,&#xd;
    &quot;bk_supplier_account&quot;:&quot;0&quot;,&#xd;
    &quot;condition&quot;:{&#xd;
    },&#xd;
    &quot;page&quot;:{&#xd;
        &quot;start&quot;:500000,&#xd;
        &quot;limit&quot;:20,&#xd;
        &quot;sort&quot;:&quot;bk_inst_id&quot;&#xd;
    }&#xd;
}</stringProp>
                <stringProp name="Argument.metadata">=</stringProp>
              </elementProp>
            </collectionProp>
          </elementProp>
          <stringProp name="HTTPSampler.path">api/c/compapi/v2/cc/search_inst_by_object/</stringProp>
          <stringProp name="HTTPSampler.method">POST</stringProp>
          <boolProp name="HTTPSampler.follow_redirects">true</boolProp>
          <boolProp name="HTTPSampler.auto_redirects">false</boolProp>
          <boolProp name="HTTPSampler.use_keepalive">true</boolProp>
          <boolProp name="HTTPSampler.DO_MULTIPART_POST">false</boolProp>
        </HTTPSamplerProxy>
        <hashTree/>
        <HTTPSamplerProxy guiclass="HttpTestSampleGui" testclass="HTTPSamplerProxy" testname="search_inst_by_object-switchport" enabled="false">
          <boolProp name="HTTPSampler.postBodyRaw">true</boolProp>
          <elementProp name="HTTPsampler.Arguments" elementType="Arguments">
            <collectionProp name="Arguments.arguments">
              <elementProp name="" elementType="HTTPArgument">
                <boolProp name="HTTPArgument.always_encode">false</boolProp>
                <stringProp name="Argument.value">{&#xd;
    &quot;bk_app_code&quot;:&quot;bk_sops&quot;,&#xd;
    &quot;bk_app_secret&quot;:&quot;72f2505a-585c-44e5-858a-dc1e76e0d33a&quot;,&#xd;
    &quot;bk_username&quot;:&quot;admin&quot;,&#xd;
    &quot;bk_obj_id&quot;:&quot;switch_port&quot;,&#xd;
    &quot;bk_supplier_account&quot;:&quot;0&quot;,&#xd;
    &quot;condition&quot;:{&#xd;
    },&#xd;
    &quot;page&quot;:{&#xd;
        &quot;start&quot;:0,&#xd;
        &quot;limit&quot;:20,&#xd;
        &quot;sort&quot;:&quot;bk_inst_id&quot;&#xd;
    }&#xd;
}</stringProp>
                <stringProp name="Argument.metadata">=</stringProp>
              </elementProp>
            </collectionProp>
          </elementProp>
          <stringProp name="HTTPSampler.path">api/c/compapi/v2/cc/search_inst_by_object/</stringProp>
          <stringProp name="HTTPSampler.method">POST</stringProp>
          <boolProp name="HTTPSampler.follow_redirects">true</boolProp>
          <boolProp name="HTTPSampler.auto_redirects">false</boolProp>
          <boolProp name="HTTPSampler.use_keepalive">true</boolProp>
          <boolProp name="HTTPSampler.DO_MULTIPART_POST">false</boolProp>
        </HTTPSamplerProxy>
        <hashTree/>
        <HTTPSamplerProxy guiclass="HttpTestSampleGui" testclass="HTTPSamplerProxy" testname="batch_update_inst-switchport" enabled="false">
          <boolProp name="HTTPSampler.postBodyRaw">true</boolProp>
          <elementProp name="HTTPsampler.Arguments" elementType="Arguments">
            <collectionProp name="Arguments.arguments">
              <elementProp name="" elementType="HTTPArgument">
                <boolProp name="HTTPArgument.always_encode">false</boolProp>
                <stringProp name="Argument.value">{&#xd;
    &quot;bk_app_code&quot;:&quot;bk_sops&quot;,&#xd;
    &quot;bk_app_secret&quot;:&quot;72f2505a-585c-44e5-858a-dc1e76e0d33a&quot;,&#xd;
    &quot;bk_username&quot;:&quot;admin&quot;,&#xd;
    &quot;bk_obj_id&quot;:&quot;switch_port&quot;,&#xd;
    &quot;bk_supplier_account&quot;:&quot;0&quot;,&#xd;
    &quot;update&quot;:[&#xd;
        {&#xd;
           &quot;datas&quot;:{&#xd;
             &quot;bk_inst_name&quot;:&quot;switch_port16&quot;&#xd;
           },&#xd;
           &quot;inst_id&quot;:46&#xd;
        }&#xd;
    ]&#xd;
}</stringProp>
                <stringProp name="Argument.metadata">=</stringProp>
              </elementProp>
            </collectionProp>
          </elementProp>
          <stringProp name="HTTPSampler.path">api/c/compapi/v2/cc/batch_update_inst/</stringProp>
          <stringProp name="HTTPSampler.method">POST</stringProp>
          <boolProp name="HTTPSampler.follow_redirects">true</boolProp>
          <boolProp name="HTTPSampler.auto_redirects">false</boolProp>
          <boolProp name="HTTPSampler.use_keepalive">true</boolProp>
          <boolProp name="HTTPSampler.DO_MULTIPART_POST">false</boolProp>
        </HTTPSamplerProxy>
        <hashTree/>
        <ResultCollector guiclass="ViewResultsFullVisualizer" testclass="ResultCollector" testname="View Results Tree" enabled="true">
          <boolProp name="ResultCollector.error_logging">false</boolProp>
        </ResultCollector>
        <hashTree/>
        <ResultCollector guiclass="StatVisualizer" testclass="ResultCollector" testname="Aggregate Report" enabled="true">
          <boolProp name="ResultCollector.error_logging">false</boolProp>
        </ResultCollector>
        <hashTree/>
        <ResultCollector guiclass="RespTimeGraphVisualizer" testclass="ResultCollector" testname="Response Time Graph" enabled="true">
          <boolProp name="ResultCollector.error_logging">false</boolProp>
        </ResultCollector>
        <hashTree/>
      </hashTree>
    </hashTree>
  </hashTree>
</jmeterTestPlan>